# 字符串
# 在Python中，凡是⽤引号引起来的，全是字符串
# 字符串可以⽤单引号，双引号，或者三引号引起来，没有什么区别


# 例题1：
# s1 = '李白'
# print(s1)
# print(type(s1))

# s1 = "李白"
# print(s1)
# print(type(s1))

# s1 = '''李白'''
# print(s1)
# print(type(s1))

# s1 = """李白"""
# print(s1)
# print(type(s1))

# s1 = """床前明月光，疑是地上霜
# 床前明月光，疑是地上霜
# 床前明月光，疑是地上霜
# 床前明月光，疑是地上霜
# 床前明月光，疑是地上霜
# 床前明月光，疑是地上霜"""
# print(s1)
# print(type(s1))

# 例题2：
# 请你打印出: 鲁迅说:"时间就像海绵里的水，只要愿挤，总还是有的。"
# print('鲁迅说:"时间就像海绵里的水，只要愿挤，总还是有的。"')


# 转义字符
# \n 换行
# r  原始字符串：所有的字符串都是直接按照字面的意思来使用，没有转义特殊或不能打印的字符

# 例题3：
# # s1 = '李白杜甫王维'
# # print(s1)
# s1 = '李白\n杜甫\n王维'
# print(s1)
# s1 = r'李白\n杜甫\n王维'
# print(s1)

# 例题4：
# s1 = ''
# s2 = ' '
# print(s1 == s2)

