# 例题1：查询元素3
# lst1 = ['李白', '杜甫', [1, 2, 3, 'a', 'dufu', 'libai'], '王维', ['唐诗', '宋词']]
# num = lst1[2][2]
# print(num)

# 例题2：将元素'a'修改为4
# lst1 = ['李白', '杜甫', [1, 2, 3, 'a', 'dufu', 'libai'], '王维', ['唐诗', '宋词']]
# print(lst1[2][3])
# lst1[2][3] = 4
# print(lst1)

# 例题3：在'宋词'后面增加'元曲'
# lst1 = ['李白', '杜甫', [1, 2, 3, 'a', 'dufu', 'libai'], '王维', ['唐诗', '宋词']]
# print(lst1[-1])
# lst1[-1].append('元曲')
# print(lst1)


# 例题4：删除'dufu'元素
# lst1 = ['李白', '杜甫', [1, 2, 3, 'a', 'dufu', 'libai'], '王维', ['唐诗', '宋词']]
# print(lst1[2][-2])
# del lst1[2][-2]
# print(lst1)