# 集合：无序、不重复元素
# 注意：创建一个空集合必须用set()而不是{ }，因为{ }是用来创建一个空字典


# 例题1：创建集合
# s = {'李白', '杜甫', '王维'}
# print(s)
# print(type(s))

# s = set()
# print(s)
# print(type(s))

# s = {}
# print(s)
# print(type(s))


# 例题2：集合的元素必须可哈希
# s = {1, '张三', False, True, ('1', '2')}
# print(s)

# s = {1, '张三', False, True, {'1': '李白', '2': '杜甫'}}
# print(s)

# s = {1, '张三', False, True, ['李白', '杜甫']}
# print(s)

# s = {1, '张三', False, True, {'李白', '杜甫'}}
# print(s)


# 例题3：列表变集合，集合变列表
# lst1 = ['李白', '杜甫', '王维', '白居易', '杜甫', '王维']
# s = set(lst1)
# print(s)
# lst2 = list(s)
# print(lst2)


# 例题4：集合元素的添加add()
# s = {'李白', '杜甫', '王维'}
# s.add('白居易')
# print(s)
# s.add('白居易')
# print(s)


# 例题5：集合元素的添加update()
# 参数可以是列表，元组，字典等
# s1 = {'李白', '杜甫', '王维'}
# s2 = {'白居易', '李商隐', '杜甫'}
# s1.update(s2)
# print(s1)

# s1 = {'李白', '杜甫', '王维'}
# lst = ['白居易', '李商隐', '杜甫']
# s1.update(lst)
# print(s1)


# s1 = {'李白', '杜甫', '王维'}
# tup = ('白居易', '李商隐', '杜甫')
# s1.update(tup)
# print(s1)


# 例题6：集合元素的移除remove()
# s = {'李白', '杜甫', '王维'}
# s.remove('杜甫')
# print(s)

# s = {'李白', '杜甫', '王维'}
# s.remove('杜牧')
# print(s)


# 例题7：集合元素的移除discard()
# 移除集合中的元素，如果元素不存在，不会发生错误
# s = {'李白', '杜甫', '王维'}
# s.discard('杜甫')
# print(s)

# s = {'李白', '杜甫', '王维'}
# s.discard('杜牧')
# print(s)


# 例题8：集合元素的移除pop()
# 随机删除集合中的一个元素
# s = {'李白', '杜甫', '王维'}
# ret = s.pop()
# print(ret)
# print(s)


# 例题9：计算集合元素个数len()
# s = {'李白', '杜甫', '王维'}
# num = len(s)
# print(num)


# 例题10：判断元素是否在集合
# s = {'李白', '杜甫', '王维'}
# a = '杜甫' in s
# print(a)
# b = '杜牧' in s
# print(b)


# 例题11：集合的交集、并集、差集
# 交集 &
# s1 = {'李白', '杜甫', '王维'}
# s2 = {'李商隐', '杜甫', '白居易'}
# s3 = s1 & s2
# print(s3)

# 并集 |
# s1 = {'李白', '杜甫', '王维'}
# s2 = {'李商隐', '杜甫', '白居易'}
# s3 = s1 | s2
# print(s3)

# 差集 -
# s1 = {'李白', '杜甫', '王维'}
# s2 = {'李商隐', '杜甫', '白居易'}
# s3 = s1 - s2
# print(s3)
# s4 = s2 - s1
# print(s4)
