# 索引：起始下标是0(从左到右), (-1)从右到左
# 切片: s[起始位置: 结束位置: 步长]    特点:顾头不顾尾


# 例题1：索引
s = '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
# print(s[0])
# print(s[1])
# print(s[2])
# print(s[3])
# print(s[4])

# print(s[-1])
# print(s[-2])
# print(s[-3])
# print(s[-4])

# print(s[100])


# 例题2：切片
# s1 = '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
# print(s1[0:4])

# s1 = '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
# print(s1[6:11])

# s1 = '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
# print(s1[6:11]+ s1[18:23])


# 例题3：切片：默认开头、默认结尾
# s1 = '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
# print(s1[18:])


# s1 = '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
# print(s1[:5])


# 例题4：切片：负数
# s1 = '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
# print(s1[-12:-7])

# s1 = '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
# print(s1[-12:])

# s1 = '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
# print(s1[:-12])


# 例题5：步长
# s1 = '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
# print(s1[0:20:2])

# s1 = '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
# print(s1[0:20:3])

# s1 = '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
# print(s1[0:20:6])

# s1 = '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
# print(s1[20:0:-1])

# s1 = '床前明月光，疑是地上霜。举头望明月，低头思故乡。'
# print(s1[20:0:-2])